Repository: mediafactory/tryton_client_desktop
Catalog: doc/*/glossary.po
Languages: de_de

source: Glossary ########
de_de: Glossar #######

source: Actions An *action* is a function which is triggered by a user intervention. *Actions* are called from activating menu items or pushing buttons. Actions often provide :term:`wizards`.
de_de: Aktionen Eine *Aktion* ist eine Funktion, die durch einen Benutzereingriff ausgelöst wird. *Aktionen* werden über Menü-Einträge oder Drücken von Knöpfen aufgerufen. Aktionen stellen oft :term:`Wizards` bereit.

source: Board The *board* is a type of :term:`views` able to handle other views. This view type is not documented or not used for now.
de_de: Infoseite Die *Infoseite* ist ein :term:`Sicht`-Typ, mit der Möglichkeit andere Sichten zu verarbeiten. Diese Art von Sicht ist weder dokumentiert noch bisher benutzt.

source: Character Encoding See [WP-ENCOD]_
de_de: Zeichen Kodierung Siehe [WP-ENCOD]_

source: CSV File format for Comma Separated Values. See [WP-CSV]_
de_de: CSV Dateiformat für Komma separierte Werte (Comma Separated Values). Siehe [WP-CSV]_

source: Data *Data* means information content produced by users.
de_de: Daten *Daten* sind Informationen, welche von Benutzern erstellt wurden.

source: Dialog A *dialog* is a :term:`popup` window, which overlays other windows and request user interaction. *Dialogs* are used to set up special :term:`actions`.
de_de: Dialog *Dialoge* werden benutzt um Einstellungen für verschiedene :term:`Aktionen` abzufragen oder um eine Bestätigung des Benutzers abzuwarten.

source: Fields *Fields* are attributes of a *data object*. *Fields* are represented as table fields in relational databases.
de_de: Felder *Felder* sind Attribute von *Daten-Objekten*. Die *Felder* sind in relationalen Datenbanken als Tabellenspalten dargestellt.

source: Form View The *form* is a mode of :term:`views`, which displays single :term:`records` of data.
de_de: Formularansicht Die *Formularansicht* ist ein :term:`Sicht-Typ <Sicht>`, der einen einzigen :term:`Datensatz` darstellt.

source: Form The *form* is the general type of :term:`views` used in Tryton. The *form* provides several modes for presenting :term:`data`:
de_de: Formular Das *Formular* ist eine grundlegende Art von :term:`Sicht` in Tryton. *Formulare* können unterschiedliche Sichten auf :term:`Daten`: bereitstellen.

source: * :term:`Form View` * :term:`Tree View` * :term:`Graph View`
de_de: * :term:`Formularansicht` * :term:`Baumansicht` * :term:`Diagrammansicht`

source: Graph View *Graph view* is a mode of :term:`views` to show sets of data in a diagram. *Graph views* can be pie-charts or bar-charts.
de_de: Diagrammansicht *Diagrammansicht* ist eine Art von :term:`Sicht` um Datensätze in einem Diagramm darzustellen. Die *Diagrammansichten* können Tortendiagramme oder Balkendiagramme sein.

source: Main Frame The *main frame* is a huge part arranged in the center of the :term:`Tryton client`. *Using the Tryton client* means mainly using the *main frame* part. It contains :term:`tabs` to organize and to show different :term:`views`.
de_de: Hauptbereich Der *Hauptbereich* ist eine großer Teil in der Mitte des :term:`Tryton Client`. *Den Tryton Client benutzen* bezeichnet hauptsächlich den *Hauptbereich*. Er beinhaltet :term:`Tabs` um die verschiedenen :term:`Formulare <Formular>` zu ordnen und darzustellen.

source: Model A *model* describes how data is represented and accessed. Models formally define records and relationships for a certain domain of interest.
de_de: Modell Ein *Modell* beschreibt wie Daten intern strukturiert und gespeichert werden. Modelle legen auch fest, wie auf Daten zugegriffen wird. Modelle definieren den Rahmen, in dem Datensätze und Beziehungen für ein bestimmtes Aufgabengebiet hinterlegt werden können.

source: Modules *Modules* are enclosed file packages for the :term:`Tryton server`. A *Module* defines the :term:`Model`, the presentation of the information (:term:`views`), functions, :term:`actions` and default presets. Additionally *modules* may provide standardized data like ISO names for countries. *Modules* in Tryton are build up generically. That is, they are constructed as simple as possible to provide the desired functionality.
de_de: Module *Module* sind Pakete aus Dateien für den :term:`Tryton Server`. Ein *Module* definiert :term:`Modelle <Modell>`, die Präsentation der Information (:term:`Sichten <Sicht>`), Funktionen, :term:`Aktionen` und Voreinstellungen. Zusätzlich können *Module* standardisierte Systemdaten wie zum Beispiel die ISO Namen der Länder beinhalten. *Module* sind in Tryton generisch aufgebaut. Das bedeutet, sie sind so einfach, dass die meisten nur die grundlegende Funktionalität bereitzustellen. Spezielle Anpassungen für unterschiedliche Anwendungsfälle werden in Zusatzmodulen realisiert.

source: Plugins A *plugin* is an add-on module for the :term:`Tryton client`.
de_de: Plugins Ein *Plugin* ist ein Zusatzmodul für den :term:`Tryton Client`.

source: Popup A small window which pops up the main window.
de_de: Popup Ein kleines Fenster, welches sich im Hauptbereich in den Vordergrund stellt.

source: Records A *record* is a singular dataset in a :term:`Model`. *Records* are represented as lines or *records* in a relational database table.
de_de: Datensatz Ein Datensatz ist eine zusammengefasste Einheit von :term:`Datenfeldern <felder>`. *Datensätze* werden als Zeilen in einer relationalen Datenbank-Tabellen dargestellt.

source: Tabs *Tabs* are :term:`widgets` to arrange different contents side by side. They are used to switch quickly between different domains of interest. Tryton uses *tabs* in two layer:
de_de: Tabs *Tabs* sind :term:`Widgets` um verschiedene Inhalte nebeneinander darzustellen. Sie werden benutzt um zwischen verschiedenen Aufgabengebieten umzuschalten. Tryton benutzt *Tabs* auf zwei Ebenen:

source: * A tabbed :term:`Main Frame`. * Tabs inside :term:`Views`.
de_de: * Ein unterteilter :term:`Hauptbereich`. * Tabs innerhalb einer :term:`Sicht`.

source: The main frame consists of *tabs* that embed the main menu and all views to an appropriate :term:`model`. The other type of *tabs* is used inside of :term:`views` to split them into visual domains of the same model. These *tabs* are used for structuring contents of one model to different sub headings.
de_de: Der Hauptbereich besteht aus *Tabs*, welche das Hauptmenü und alle Sichten zu einem dazugehörigen :term:`Modell` einbetten. Der andere Typ eines *Tabs* wird innerhalb einer :term:`Sicht` benutzt um die verschiedene Bereiche des gleichen Modells visuell abzutrennen. Diese *Tabs* werden benutzt um die Inhalte eines Modells in verschiedene Unterpunkte zu strukturieren.

source: Three-Tiers A *three-tiers* application framework like Tryton, is build up of three different software components:
de_de: Drei Schichten Eine *Drei-Schichten*-Anwendungs-Plattform wie Tryton, besteht aus drei verschiedenen Software Komponenten:

source: 1. The storage or data tier. 2. The logic or application tier. 3. The presentation tier.
de_de: 1. Die Speicher- oder Daten-Schicht 2. Die Logik- oder Anwendungs-Schicht 3. Die Präsentations-Schicht

source: The storage tier in the Tryton framework is provided by the PostgreSQL database engine. The application logic tier is provided by :term:`Tryton server` and its :term:`modules`. The presentation tier is mainly provided by the :term:`Tryton client`. In a *three tiers* framework, the presentation tier (client) never connects directly to the storage tier. All communication is controlled by the application tier.
de_de: Die Speicher-Schicht im Tryton-Plattform wird durch die PostgreSQL Datenbank bereitgestellt. Die Logik-Schicht wird durch den :term:`Tryton Server` und dessen :term:`Module` zur Verfügung gestellt. Die Präsentations-Schicht ist hauptsächlich durch den :term:`Tryton Client` dargestellt. In einer *Drei-Schichten*-Architektur verbindet sich die Präsentations-Schicht (Client) nie direkt mit der Speicher-Schicht. Jede Kommunikation wird durch die Logik-Schicht überwacht.

source: Tree View *Tree view* is a mode of :term:`views` showing sets of :term:`data`. *Tree views* can be flat lists or tables as well as tree-like nested lists.
de_de: Baumansicht Die *Baumansicht* ist ein :term:`Sicht-Typ <Sicht>`, der mehrere :term:`Datensätze <Datensatz>` gleichzeitig anzeigt. *Baumansichten* können flache Listen oder Tabellen wie auch verschachtelte baumartige Listen sein.

source: Tryton Server The *Tryton server* is the application or logic tier in the :term:`three-tiers` application platform *Tryton*. The *Tryton server* connects the underlying application logic of the different :term:`modules` with corresponding database records. The *Tryton server* provides different interfaces to present the generated information:
de_de: Tryton Server Der *Tryton Server* ist die Anwendungs- oder Logik-Schicht in der :term:`drei Schichten` Anwendungs-Plattform *Tryton*. Der *Tryton Server* verbindet die zugrunde liegende Anwendungslogik der verschiedenen :term:`Module` mit den dazugehörigen Datensätzen. Der *Tryton Server* stellt verschiedene Schnittstellen zur Darstellung der erstellten Informationen bereit:

source: * :term:`Tryton client`: (graphical user interface GUI) * XMLRPC see [WP-XMLRPC]_ * WebDAV see [WP-WebDAV]_ * OpenOffice
de_de: * :term:`Tryton Client`: (grafische Benutzeroberläche GUI) * XMLRPC siehe [WP-XMLRPC]_ * WebDAV siehe [WP-WebDAV]_ * OpenOffice

source: Tryton Client The *Tryton client* application is the graphical user interface (GUI) of the :term:`Tryton server`.
de_de: Tryton Client Die *Tryton client* Anwendung ist der grafische Benutzeroberfläche (GUI) des :term:`Tryton Servers <Tryton server>`.

source: Views A *view* is the visual presentation of :term:`data`. *Views* resides inside :term:`tabs` in the :term:`main frame` of the :term:`Tryton client`. There are two general types of *views* in Tryton:
de_de: Sicht Eine *Sicht* ist die visuelle Präsentation von :term:`Daten`. *Sichten* befinden sich in :term:`Tabs` im :term:`Hauptbereich` des :term:`Tryton Client`. Es gibt zwei grundsätzliche Typen von *Sichten* in Tryton:

source: 1. :term:`Form` 2. :term:`Board`
de_de: 1. :term:`Formular` 2. :term:`Infoseite`

source: Each of the view types has different modes to show data. *Views* are built of several :term:`widgets` and provide often additional :term:`actions`. It is also possible to present the same data in different view modes alternately.
de_de: Jede der Sichten-Typen hat verschiedene Arten der Darstellung. *Sichten* sind aus mehreren :term:`Widgets` aufgebaut und stellen oft zusätzliche :term:`Aktionen` bereit. Es ist auch möglich die gleichen Daten mit verschiedenen alternativen Sichten darzustellen.

source: Widgets A *Widget* is a visual element of a graphical user interface (GUI). Some *Widgets* solely show informations, others allow manipulation from user side. Example *Widgets* are buttons, check-boxes, entry-boxes, selection lists, tables, lists, trees, ...
de_de: Widgets Ein *Widget* ist ein visuelles Steuerelement der grafischen Benutzeroberfläche (GUI). Einige *Widgets* stellen lediglich Informationen dar, Andere erlauben es dem Benutzer Änderungen zu machen. Bespiele von *Widgets* sind Knöpfe, Check-Boxen, Eingabefelder, Auswahllisten, Tabellen, Listen, Bäume, ...

source: Wizards *Wizards* define stateful sequences of interaction to proceed complex :term:`actions`. A *wizard* divides the complexity of some actions into several user guided steps.
de_de: Wizards *Wizards* beinhalten mehrere aufeinander folgende Schritte um komplexe :term:`Aktionen` auszuführen. Ein *Wizard* teilt die Komplexität mancher Aktionen in mehrere geführte Schritte auf.

source: References **********
de_de: Quellen *******

source: .. [WP-XMLRPC] http://en.wikipedia.org/wiki/Xmlrpc
de_de: .. [WP-XMLRPC] http://de.wikipedia.org/wiki/XMLRPC

source: .. [WP-WebDAV] http://en.wikipedia.org/wiki/Webdav
de_de: .. [WP-WebDAV] http://de.wikipedia.org/wiki/Webdav

source: .. [WP-CSV] http://en.wikipedia.org/wiki/Comma-separated_values .. [WP-ENCOD] http://en.wikipedia.org/wiki/Character_encoding
de_de: .. [WP-CSV] http://de.wikipedia.org/wiki/CSV_%28Dateiformat%29 .. [WP-ENCOD] http://de.wikipedia.org/wiki/Zeichenkodierung
