Repository: mediafactory/tryton_client_desktop
Catalog: doc/*/usage.po
Languages: de_de

source: Normal: Shows the client in full feature mode.
de_de: Normal: Alle Funktionen des Clients werden angezeigt.

source: PDA: Shows the client in a condensed mode. The PDA (Personal Data Assistant) mode hides the shortcut menu in tree views and the system status bar.
de_de: PDA: Der Client wird im abgespeckter Form angezeigt. Der PDA (Persönlicher Daten Assistent) Modus blendet das Favoriten Menü in der Baumansicht und die Statusleiste aus.

source: Form ++++
de_de: Formular ++++++++

source: Toolbar: Checkbox to disable/enable the tool bar.
de_de: Werkzeugleiste: Kontrollkästchen um die Werkzeugleiste ein- und auszuschalten.

source: Statusbar: Checkbox to disable/enable the status bar.
de_de: Statusleiste: Kontrollkästchen um die Statusleiste ein- und auszuschalten.

source: Save Width/Height: Check box to enable saving of manually adjusted widths of columns in lists and trees. Additionally saving of manually adjusted widths and heights of dialog and popup windows.
de_de: Breite/Höhe speichern: Kontrollkästchen zum speichern der manuell geänderte Breite von Spalten in Listen und Bäumen. Zusätzlich werden die manuell angepassten Breiten und Höhen der Dialog- und Popup-Fenster gespeichert.

source: Spell Checking: Check box to enable spell checking in fields.
de_de: Rechtschreibkorrektur: Kontrollkästchen um die Rechtschreibkorrektur in Feldern einzuschalten.

source: Tabs Position Sets up the position of the :term:`tabs` inside :term:`views`:
de_de: Position der Tabs: Stellt die Position der :term:`Tabs` innerhalb von :term:`Sichten <Sicht>` ein:

source: * Top * Left * Right * Bottom
de_de: * Oben * Links * Rechts * Unten

source: File Actions...: Opens a dialog to set up file types for print and open actions. Use ``"%s"`` as a placeholder for the document name.
de_de: Dateiaktionen... Öffnet einen Dialog um zu den Dateitypen die entsprechende Druck und Öffnen-Aktion auszuwählen. Der Dokumentenname wird mit ``"%s"`` als Platzhalter angegeben.

source: * Provided file types:
de_de: * Unterstützte Dateitypen:

source: - ODT file: Open Office Writer Document - PDF file: Adobes(TM) Portable Document Format - PNG file: Portable Network Graphics format - TXT file: Pure text file
de_de: - ODT Datei: Open Office Writer Dokument - PDF Datei: Adobes(TM) Portable Document Format - PNG Datei: Portable Network Graphics Format - TXT Datei: Reine Text-Datei

source: * Provided actions
de_de: * Unterstützte Aktionen

source: - Open: Setting up program system call which opens the specific file type. - Print: Setting up program system call printing the specific file type.
de_de: - Öffnen: Das aufzurufende Programm und Parameter welche die angegebene Datei öffnet - Drucken: Das aufzurufende Programm und Parameter welches die angegebene Datei druckt

source: Email...: Open a dialog to set up an email reader.
de_de: E-Mail...: Öffnet einen Dialog um das E-Mail-Programm einzustellen.

source: * Command Line: The command line calling the email reader. * Placeholders:
de_de: * Kommandozeile: Die Kommandozeile um das E-Mail-Programm aufzurufen * Platzhalter:

source: - ``${to}``: the destination email address - ``${cc}``: the carbon copy email address - ``${subject}``: the subject of the email - ``${body}``: the body of the email - ``${attachment}``: the attachment of the email
de_de: - ``${to}``: Die Empfänger E-Mail-Adressen - ``${cc}``: Die Empfänger E-Mail-Adressen, die eine Kopie der E-Mail erhalten sollen. - ``${subject}``: Der Betreff der E-Mail - ``${body}``: Der Textteil der E-Mail - ``${attachment}``: Der Anhang der E-Mail

source: * Examples:
de_de: * Beispiele:

source: - Thunderbird 2 on Linux: ``thunderbird -compose "to='${to}',cc='${cc}',subject='${subject}',body='${body}',attachment='file://${attachment}'"``
de_de: - Thunderbird 2 unter Linux: ``thunderbird -compose "to='${to}',cc='${cc}',subject='${subject}',body='${body}',attachment='file://${attachment}'"``

source: - Thunderbird 2 on Windows XP SP3: ``"C:\\Program Files\\Mozilla Thunderbird\\thunderbird.exe" -compose to="${to}",cc="${cc}",subject="${subject}",body="${body}",attachment="${attachment}"``
de_de: - Thunderbird 2 auf Windows XP SP3: ``"C:\\Programme\\Mozilla Thunderbird\\thunderbird.exe" -compose to="${to}",cc="${cc}",subject="${subject}",body="${body}",attachment="${attachment}"``

source: .. note:: The path of *Program Files* may vary dependent on the localization of your Windows version.
de_de: .. note:: Der Pfad von *Programme* unterscheidet sich womöglich erheblich abhängig der Sprache ihrer Windows Version.

source: Save Options: Saves all the options.
de_de: Einstellungen speichern: Speichert alle Einstellungen.

source: Plug-ins ^^^^^^^^ Plug-ins are client side add-ons for Tryton. There are some included plug-ins with the standard client.
de_de: Plugins ^^^^^^^ Plugins sind clientseitige Erweiterungen für Tryton. Es gibt ein paar Plugins, die Tryton im Standard mitbringt.

source: Execute a Plug-in +++++++++++++++++ Translate View: Creates a translation table of the current view.
de_de: Ein Plugin ausführen ++++++++++++++++++++ Aktuelle Sicht übersetzen: Erstellt eine Übersetzungstabelle der aktuellen Sicht.

source: Print Workflow: Creates a graph which shows the work flow of the current view.
de_de: Workflow drucken: Erstellt ein Schaubild, welches den Workflow der aktuellen Sicht zeigt.

source: Print Workflow (complex): Like 'Print Workflow', with additional sub work flows inherited by the current view.
de_de: Erweiterten Workflow drucken: Wie `Workflow drucken`, allerdings mit zusätzlichen Unter-Workflows welche von der aktuellen Sicht abhängig sind.

source: Shortcuts ^^^^^^^^^ A collection of user defined shortcuts for specific resources.
de_de: Favoriten ^^^^^^^^^ Eine Sammlung von benutzerdefinierten Favoriten für spezielle Resourcen.

source: Help ^^^^
de_de: Hilfe ^^^^^

source: Tips...: Opens the tips dialog.
de_de: Tipps...: Öffnet den Tipp Dialog.

source: * Display a new tip next time: If *checked*, the tips dialog will appear on start. * Previous: Shows last tip. * Next: Shows next tip.
de_de: * Tipps beim Start von Tryton anzeigen: Der Tipps Dialog wird beim Start des Tryton Clients angezeigt * Vorheriger: Zeigt den letzten Tipp * Nächster: Zeigt den nächsten Tipp

source: Keyboard Shortcuts...: Shows the information dialog of the predefined keyboard shortcut map.
de_de: Schnelltasten...: Zeigt einen Informationsdialog über die vordefinierten Tastaturkürzel an.

source: * Edition Widgets: Shows shortcuts working on text entries, relation entries and date/time entries.
de_de: * Widgets zur Bearbeitung: Zeigt Schnelltasten für Texteinträge, verknüpfte Einträge und Datums/Zeiteinträge

source: About...: License, Contributors, Authors of Tryton
de_de: Über...: Lizenz, Mitwirkende, Authoren von Tryton

source: Appendix ********
de_de: Anhang ******

source: Configuration File ^^^^^^^^^^^^^^^^^^
de_de: Konfigurations-Dateien ^^^^^^^^^^^^^^^^^^^^^^

source: ~/.config/tryton/x.y/tryton.conf # General configuration ~/.config/tryton/x.y/accel.map # Accelerators configuration
de_de: ~/.config/tryton/x.y/tryton.conf # Generelle Konfiguration ~/.config/tryton/x.y/accel.map # Konfiguration der Kurzbefehle

source: :Authors: Udo Spallek, Bertrand Chenal, Mathias Behrle, Anne Krings
de_de: :Authoren: Udo Spallek, Bertrand Chenal, Mathias Behrle, Anne Krings
