Repository: mediafactory/tryton_client_desktop
Catalog: doc/*/usage.po
Languages: de_de

source: * Allowed characters are alpha-nummeric [A-Za-z0-9] and underscore (_). * First character must be an alphabetic letter. * The maximum length of a database name is 64 characters.
de_de: * Erlaubte Zeichen sind alpha-numerisch [A-Za-z0-9] und das Zeichen - Unterstrich [_]. * Das erste Zeichen muss ein alphabetischer Buchstabe sein. * Die maximale Länge eines Datenbank-Namens beträgt 64 Zeichen.

source: Tryton automatically checks if the given database name follows the rules.
de_de: Tryton überprüft automatisch ob der angegebene Namen diesen Regeln entspricht.

source: New Database Opens a :term:`dialog` for creating a new Tryton database with an initial user called *admin*.
de_de: Neue Datenbank Öffnet einen :term:`Dialog` um eine neue Tryton Datenbank mit einem ersten Benutzer "admin" zu erstellen.

source: * Server Setup:
de_de: * Tryton Server Einstellungen:

source: - `Server Connection`__ - Tryton Server Password: The password given in the Tryton server configuration.
de_de: - `Serververbindung`__ - Tryton Server Passwort: Das in der Tryton Server Konfiguration hinterlegte Server Passwort.

source: * New Database Setup:
de_de: * Datenbank Einstellungen:

source: - Database Name: The name of the new database. - Default Language: The default language of the new database. - Admin Password: The *admin*-user password of the new database. - Confirm Admin Password: Repeat the password of the new 'admin' user.
de_de: - Name: Der Name der neuen Datenbank - Standard Sprache: Die standard Sprache der neuen Datenbank - Administrator Passwort: Das *admin*-Benutzer Passwort der neuen Datenbank - Passwort Wiederholung: Erneute Passwort-Eingabe des neuen 'admin'-Benutzers

# usage.rst:346
source: * Actions:
de_de: * Aktionen:

source: - Create: Creates the new database with initial user *admin* and the provided password. - Cancel
de_de: - Erstellen: Erstellt die neue Datenbank mit dem ersten Benutzer *admin* und dem angegebenen Passwort - Abbrechen: Bricht den Dialog ab ohne zu speichern.

source: .. note:: The appropriate Tryton database user (defined in the Tryton server configuration) needs to be authorized to create databases for this step.
de_de: .. note:: Der entsprechende Tryton Datenbank Benutzer (definiert in der Tryton Server Konfiguratin) muss authorisiert werden um die Datenbank zu erstellen.

source: Restore Database Opens a :term:`dialog` to restore a previously created database backup file.
de_de: Datenbank wiederherstellen Öffnet einen :term:`Dialog` um eine vorher erstelltes Datenbankbackup aus einer Datei wiederherzustellen.

source: * File choose menu dialog
de_de: * *Backup Datei für Wiederherstellung öffnen...* Dialog

source: - Choose a database backup file in the file system to be restored. - Actions:
de_de: - Aus dem Dateisystem eine Datenbankbackup-Datei auswählen - Aktionen:

source: + Open: Open the chosen backup file. + Cancel
de_de: + Öffnen: Öffnet die ausgewählte Backup-Datei + Abbrechen: Bricht den Vorgang ab.

source: * Restore Database dialog:
de_de: * *Datenbank wiederherstellen* Dialog:

source: - `Server Connection`__ - Tryton Server Password: The password given in the Tryton server configuration. - File to Restore: Show filename and path. - New Database Name: Enter a new name for the database to be restored - Actions:
de_de: - `Serververbindung`__ - Tryton Server Passwort: Das in der Tryton Server Konfiguration hinterlegte Server Passwort. - Datei zur Wiederherstellung: Zeigt den Dateinamen und den Pfad an. - Name für neue Datenbank: Neuer Name der wiederherzustellenden Datenbank - Aktionen:

source: + Restore: Proceed database restore. + Cancel
de_de: + Wiederherstellen: Datenbank Wiederherstellung ausführen + Abbrechen: Bricht den Vorgang ab.

source: Backup Database Open a :term:`dialog` to backup an existing database and save it as a file.
de_de: Datenbank sichern Öffnet einen :term:`Dialog` um eine existierende Datenbank in eine Datei zu sichern.

source: * `Backup a Database` dialog
de_de: * `Datenbank sichern` Dialog

source: - `Server connection`__ - Database: Choose the Tryton database to backup. - Tryton Server Password: The password given in the Tryton server configuration. - Actions:
de_de: - `Serververbindung`__ - Datenbank: Auswahl der zu sichernden Tryton Datenbank - Tryton Server Passwort: Das in der Tryton Server Konfiguration hinterlegte Server Passwort. - Aktionen:

source: + Backup: Proceed database backup. + Cancel
de_de: + Sichern: Datenbank Sicherung ausführen + Abbrechen: Bricht den Vorgang ab.

source: * `Save Backup File` dialog
de_de: * `Speichern unter...` Dialog

source: - Choose a filename and location for the created backup file. - Save the backup file.
de_de: - Auswahl eines Dateinamens und Ort der erstellten Sicherungs-Datei. - Speichern der Sicherungs-Datei.

source: Drop Database Open a :term:`dialog` to delete an existing Tryton database.
de_de: Datenbank löschen Öffnet einen :term:`Dialog` um eine existierende Tryton Datenbank zu löschen.

source: * `Delete a Database` dialog
de_de: * `Datenbank löschen` dialog

source: - `Server Connection`__ - Database: Choose a database to delete. - Tryton Server Password: The password given in the Tryton server configuration.
de_de: - `Serververbindung`__ - Datenbank: Auswahl der zu löschenden Datenbank - Tryton Server Passwort: Das in der Tryton Server Konfiguration hinterlegte Server Passwort.

source: * Confirmation Dialog
de_de: * Bestätigungs Dialog

source: - Yes: Drop the database - No: Do not drop the database - Cancel
de_de: - Ja: Löscht die Datenbank - Nein: Keine Löschung der Datenbank - Abbrechen: Bricht den Vorgang ab.

source: Server (connection) dialog: This :term:`dialog` is widely used to setup a Tryton server connection. This dialog shows the actual state of the client/server communication. It also shows when there is no connection to a Tryton server at all. The *Change* button opens a dialog for connection details:
de_de: *Serververbindung* Dialog: Dieser :term:`Dialog` wird häufig benutzt um die Tryton Serververbindung einzustellen. Dieser Dialog zeigt den aktuellen Status der Client/Server Kommunikation. Es zeigt zusätzlich an wenn keine Verbindung zum Tryton Server besteht. Der *Bearbeiten* Knopf öffnet den Dialog der Verbinungs Details:

source: * Server: Network address or IP number of the Tryton server (protocols are not supported) * Port: Port where the Tryton server listens.
de_de: * Server: Netzwerkname oder IP-Adresse des Tryton Servers (Protokollangaben sind nicht unterstützt) * Port: Port auf dem der Tryton Server lauscht.

source: .. note:: If there is no connection to a Tryton server, many items in menu bar and tool bar are deactivated.
de_de: .. note:: Falls keine Verbindung zum Tryton Server besteht, sind viele Einträge des Menüs und der Werkzeugleiste deaktiviert

source: User ^^^^ This menu bar item controls the preferences of the actual user and connects to the *request system* in Tryton.
de_de: Benutzer ^^^^^^^^ Dieser Eintrag der Menüleiste stellt die Eigenschaften des aktuellen Benutzers ein und stellt die Verbindung mit dem *Anfrage System* von Tryton bereit.

source: Preferences... A preference dialog opens, where the actual user can show and edit his personal settings. All user preferences are stored server side. I.e. logging in with the same credentials from different computers always restores the same preferences.
de_de: Einstellungen ... Ein Einstellungsdialog öffnet sich, in dem der aktuelle Benutzer seine persönlichen Einstellungen anzeigen und ändern kann. Alle Benutzereigenschaften werden serverseitig gespeichert. Beispielsweise werden beim anmelden an einem anderen Computer diese Einstellungen wiederhergestellt.

source: * Name: Real name of the Tryton user. * Password: Password of the Tryton user. * Email: Email address of the Tryton user. * Signature: Signature block for the Tryton user. * Menu Action: Defines the action which is called as the `main menu`_. * Home Action: Defines the action which is called as `home action`__. * Language: Language of the client interface. * Timezone: The local timezone where the user/client resides. * Groups: Displays the users membership to access groups.
de_de: * Name: bürgerlicher Name des Tryton Benutzers. * Passwort: Passwort des Tryton Benutzers. * E-Mail: E-Mail-Adresse des Tryton Benutzers. * Signatur: Signaturblock des Tryton Benutzers. * Menüaktion: Definiert die Aktion, welche als `Hauptmenü`__ ausgeführt wird. * Startseite: Definiert die Aktion, welche als `Startseite` ausgeführt wird. * Sprache: Sprache der Benutzeroberfläche. * Zeitzone: Die lokale Zeitzone in der sich der Benutzer befinden. * Gruppenzugehörigkeit: Definiert die Mitgliedschaften um Zugriffe zu regeln.

source: Send a Request Opens a tab in :term:`form view` which enables the user to send requests to other users of the same database.
de_de: Anfrage senden Öffnet einen Tab als :term:`Formularansicht` der dem Benutzer erlaubt anderen Benutzern der gleichen Datenbank Anfragen zu senden.

source: Read my Requests Opens a tab in :term:`tree view` showing all requests related to the actual user. Fields and actions of requests:
de_de: Meine Anfragen lesen: Öffnet ein Tab als :term:`Baumansicht` der dem aktuellen Benutzer alle zugehörigen Anfragen zeigt. Anfragen haben folgende Felder und Aktionen:

source: * On top
de_de: * Oben

source: - From: User name of the sender - To: User name of the request recipient - References: Count of the attached references - Subject: The subject of the request. - Priority: An importance priority of the request.
de_de: - Von: Benutzername des Senders - An: Benutzername des Empfängers - Verweise: Anzahl der angehängten Verweise - Betreff: Der Betreff der Anfrage - Dringlichkeit: Eine Priorisierung der Anfrage

source: + High + Low + Normal
de_de: + Hoch + Niedrig + Normal

source: * *Request* tab
de_de: * *Anfrage* Tab

source: - Body: The textual part of the request. - History: The history of past replies to this request.
de_de: - Anfrage: Der Textteil der Anfrage - Bisherige Anfragen: Die Historie der letzten Antworten zu dieser Anfrage

source: + From: Sender of the past request + To: Receiver of the past request + Summary: Summary of the body text of the past request.
de_de: + Von: Sender der letzten Anfrage + An: Empfänger der letzten Anfrage + Zusammenfassung: Zusammenfassung des Anfrage-Textes der letzten Anfrage

source: * Trigger Date: Defines time and date when the request will be sent automatically. * State: State of the request. Possible states for the request are:
de_de: * Gültig ab: Definiert Zeit und Datum an dem die Anfrage automatisch zugestellt werden soll. * Status: Status der Anfrage. Mögliche Stati der Anfrage sind:

source: - Draft: The request is saved in the system, but not posted. - Waiting: The request is sent without receiving a reply message. - Chatting: The message is replied or in discussion. - Closed: The message is closed/fulfilled/answered.
de_de: - Entwurf: Die Anfrage ist im System gespeichert, aber nicht abgeschickt - Wartend: Die Anfrage wurde abgeschickt ohne bisher eine Antwort erhalten zu haben - Schreibt gerade: Die Nachricht ist gerade in Bearbeitung - Geschlossen: Die Nachricht wurde geschlossen/erfüllt/beantwortet

# usage.rst:512
source: * Actions:
de_de: * Aktionen:

source: - Send: Sends the actual message - Reply: Replies or answers the actual message - close: Closes the actual message
de_de: - Senden: Sendet die aktuelle Nachricht - Antworten: Erwidert oder beantwortet die aktuelle Nachricht - Schließen: Schließt die aktuelle Anfrage

source: * *References* tab
de_de: * *Verweise* Tab

source: - References
de_de: - Verweise

source: + Reference: The reference type + (Target): Defines an reference attached to the request.
de_de: + Verweise: Der Verweis Typ + (Ziel): Hängt einen Verweis an die Anfrage an.

source: .. note:: When talking about requests, think of an internal system of Tryton, which is very similar to email.
de_de: .. note:: Wenn man von Anfragen spricht, kann man sie sich vorstellen wie ein Tryton-internes E-Mail System.

source: Form ^^^^ The form menu contains functions for the *actual form* in the tab which is open. Some operations are working with one record or with a selection of :term:`records`. In :term:`form view` the actual record is selected for operations. In :term:`tree view` all selected records are used for operations.
de_de: Formular ^^^^^^^^ Das Formular Menü bietet Funktionen zum *aktuellen Formular*, welches gerade als Tab geöffnet ist. Manche Menüeinträge funktionieren mit einem Datensatz andere mit mehreren :term:`Datensätzen <Datensatz>`. In der :term:`Formularansicht` ist der aktuelle Datensatz für diese Operationen ausgewählt. In der :term:`Baumansicht` werden alle ausgewählten Datensätze benutzt.

source: New: Creates a new record.
de_de: Neu: Erstellt einen neuen Datensatz.

source: Save: Saves the actual record.
de_de: Speichern: Speichert den aktuellen Datensatz

source: Duplicate: Duplicates the content of the actual record in a newly created record.
de_de: Duplizieren: Dupliziert den Inhalt des aktuellen Datensatzes in einen neu erstellen Datensatz.

source: Delete: Deletes the selected or actual record.
de_de: Löschen: Löscht den ausgewählten oder aktuellen Datensatz.

source: Find...: Opens a :term:`dialog` for finding :term:`fields` with search criteria and operators.
de_de: Suchen...: Öffnet einen :term:`Dialog` um :term:`Felder` anhand Suchkriterien und Operatoren zu finden.

source: * Search criteria: Defines the aspects to seek for. * General search operators:
de_de: * Suchkriterien: Definiert nach den zu suchenden Kriterien * Allgemeine Such-Operatoren:

source: - Equals: Search for results which are exactly the same as the following term. - Does Not Equal: Search for results which are different from the following term.
de_de: - ist gleich: Sucht nach Ergebnissen, die exakt dem folgenden Ausdruck entsprechen - ist nicht gleich: Sucht nach Ergebnissen, die nicht exakt dem folgenden Ausdruck entsprechen

source: * Additional search operators on numbers, amounts and strings:
de_de: * Zusätzliche Such-Operatoren für Nummern, Mengen und Zeichenketten:

source: - Contains: Search for results which contain the following term. - Does Not Contain: Search for results which do not include the following term. - Starts With: Search for results beginning with the following term. - Ends With: Search for results ending with the following term.
de_de: - enthält: Sucht nach Ergebnissen, welche den folgenden Ausdruck enthält - enthält nicht: Sucht nach Ergebnissen, welche den folgenden Ausdruck nicht enthält - beginnt mit: Sucht nach Ergebnissen, welche mit folgendem Audruck beginnen - endet mit: Sucht nach Ergebnissen, welche mit folgendem Ausdruck enden

source: * Additional search operators for numbers and amounts:
de_de: * Zusätzliche Such-Operatoren für Nummern und Mengen:

source: - Is Between: Search for results inside a range (from - to). - Is Not Between: Search for results outside a range (from - to). - Is Different: Same as 'Does Not Equal', see above.
de_de: - ist zwischen: Sucht nach Ergebnissen innerhalb einer Reihe (von - bis) - ist nicht zwischen: Sucht nach Ergebnissen außerhalb einer Reihe (von - bis) - ist nicht: Gleich wie 'ist unterschiedlich', siehe oben

source: * Advanced Search expander opens additional search criteria.
de_de: * Über *Erweiterte Suche* öffnet man weitere Suchmöglichkeiten.

source: - Limit: Limits the count of results. - Offset: Skips a number of results and show only the following.
de_de: - Limit: Schränkt die Anzahl der Suchtreffer ein. - Versatz: Überspringt die angegebene Anzahl an Treffern und zeigt nur die darauf Folgenden an.

# usage.rst:591
source: * Actions:
de_de: * Aktionen:

source: - Find: Search for results of the given criteria. - New: Create a new record (used when search was fruitless, to create quickly a new record). - Ok: Open the selected results. - Cancel
de_de: - Suchen: Sucht nach Ergebnissen, welche den angegebenen Kriterien entsprechen - Neu: Erstellt einen neuen Datensatz (wird benutzt wenn durch die Suche nichts gefunden wurde und man schnell einen neuen Datensatz anlegen will) - OK: Öffnet den ausgewählten Datensatz - Abbruch: Bricht den Vorgang ab

source: .. note:: To search for deactivated records the *Active* search criteria must be set to *No*.
de_de: .. note:: Um nach inaktiven Datensätzen zu suchen muss das *Aktiv* Suchkriterium auf *Nein* gesetzt werden.

source: Next: Goes to the next record in a list (sequence).
de_de: Nächster: Geht zum nächsten Datensatz in der Liste (Reihenfolge)

source: Previous: Goes to the last record in a list (sequence).
de_de: Vorheriger: Geht zum vorherigen Datensatz in der Liste (Reihenfolge).

source: Switch View: Switches the actual view aspect to:
de_de: Ansicht wechseln: Wechselt die aktuelle Ansicht nach:

source: * :term:`Form view` * :term:`Tree view` * :term:`Graph view`
de_de: * :term:`Formularansicht` * :term:`Baumansicht` * :term:`Diagrammansicht`

source: Not all views provide all aspects.
de_de: Nicht alle Sichten stellen alle Möglichkeiten bereit.

source: Menu: Activates or reopens the menu tab.
de_de: Menü: Springt zu oder öffnet den Menü-Tab.

source: Home: Opens a new `home`__ tab.
de_de: Zur Startseite: Öffnet einen neuen `Startseite`__ Tab

source: Close Tab: Closes the current tab. A Request :term:`Dialog` opens in case of unsaved changes.
de_de: Tab schließen: Schließt den aktuellen Tab. Ein :term:`Dialog` erscheint bei ungespeicherten Änderungen.

source: Previous Tab: Shows the previous (left) tab of the actual tab.
de_de: Vorheriger Tab: Zeigt den vorherigen (linken) Tab neben dem aktuellen Tab.

source: Next Tab: Shows the next (right) tab of the actual tab.
de_de: Nächster Tab: Zeigt den nächsten (rechten) Tab neben dem aktuellen Tab.

source: View Logs...: Shows generic information of the current record.
de_de: Protokoll ansehen...: Zeigt generische Informationen des aktuellen Datensatzes.

source: Go to Record ID...: Opens specific record id in the current view.
de_de: Gehe zu Datensatz Nr...: Öffnet die angegebene Datensatznummer in der aktuellen Sicht.

source: Reload/Undo: Reloads the content of the actual tab. Undoes changes, if save request for the current record is denied.
de_de: Neu laden/Rückgängig: Lädt den Inhalt des aktuellen Tabs neu. Rückgängig machen der Änderungen, falls das Speichern des aktuellen Datensatzes fehlschlägt.

source: Actions...: Shows all actions for the actual view, model and record.
de_de: Aktionen...: Zeigt alle Aktionen der aktuellen Sicht, des Modells und Datensatzes.

source: Print...: Shows all print actions for the actual view, model and record.
de_de: Drucken...: Zeigt alle Druckaktionen der aktuellen Sicht, des Modells und Datensatzes.

source: Export Data...: Export of current/selected records into :term:`CSV`-file or open it in Excel.
de_de: Daten exportieren...: Export des aktuellen oder der ausgewählten Datensätze als :term:`CSV`-Datei oder öffnet es direkt in Excel.

source: * Predefined exports
de_de: * Vordefinierte Exporte

source: - Choose preferences of already saved exports.
de_de: - Auswahl von vorher abgespeicherten Exporteigenschaften.

source: * All Fields: Fields available from the model. * Fields to export: Defines the specific fields to export. * Options:
de_de: * Alle Felder: Verfügbare Felder des Modells * Zu exportierende Felder: Definition der speziellen, zu exportierenden Felder * Optionen:

source: - Save: Save export as a CSV file. - Open: Open export in spread sheet application.
de_de: - Speichern: Speichert den Export als CSV Datei. - Öffnen: Öffnet den Export in einem Tabellenkalkulations-Programm.

source: * Add field names: Add a header row with field names to the export data. * Actions:
de_de: * Feldnamen hinzufügen: Fügt eine Kopfzeile mit den Feldnamen zu den exportierten Daten hinzu * Aktionen:

source: - Add: Adds selected fields to *Fields to export*. - Remove: Removes selected fields from *Fields to export*. - Clear: Removes all fields from *Fields to export*. - Save Export: Saves field mapping to a *Predefined export* with a name. - Delete Export: Deletes a selected *Predefined export*. - Ok: Exports the data (action depending on *Options*). - Cancel
de_de: - Hinzufügen: Fügt die ausgewählten Felder zu *Zu exportierende Felder* hinzu - Entfernen: Löscht die ausgewählten Felder von *Zu exportierende Felder* - Leeren: Löscht alle Felder aus *Zu exportierende Felder* - Export speichern: Speichert die Feldzuweisungen in einem *vordefinierten Export* - Export löschen: Löscht einen *vordefinierten Export* - OK: Exportiert die Daten (Aktion hängt von der ausgewählten *Option* ab) - Abbrechen: Bricht den Vorgang ab.

source: Import Data...: Import records from :term:`CSV`-file.
de_de: Daten importieren...: Import von Daten von einer :term:`CSV`-Datei.

source: * All Fields: Fields available in the model (required fields are marked up). * Fields to Import: Exact sequence of all columns in the CSV file. * File to Import: File :term:`dialog` for choosing a CSV file to import. * CSV Parameters: Setup specific parameters for chosen CSV file.
de_de: * Alle Felder: Verfügbare Felder im Modell (Pflichtfelder sind markiert) * Zu importierende Felder: Genaue Reihenfolge aller Spalten der CSV-Datei * Importdatei: Öffnen :term:`Dialog` um die zu importierende CSV-Datei auszuwählen * CSV Parameter: Einstellungen der ausgewählten CSV-Datei

source: - Field Separator: Character which separates CSV fields. - Text Delimiter: Character which encloses text in CSV. - Encoding: :term:`Character encoding` of CSV file. - Lines to Skip: Count of lines to skip a headline or another offset.
de_de: - Feldtrennzeichen: Zeichen, welches die einzelnen Spalten der CSV-Datei von einander trennt. - Texttrennzeichen: Zeichen, welches Textfelder der CSV-Datei einrahmt - Kodierung: :term:'Zeichenkodierung' einer CSV-Datei. - Zu überspringende Zeilen: Anzahl zu überspringenden Zeilen wie zum Beispiel einer Überschrift oder anderen Zeilen.

# usage.rst:719
source: * Actions:
de_de: * Aktionen:

source: - Add: Adds fields to *Fields to Import*. - Remove: Deletes fields from *Fields to Import*. - Clear: Removes all fields from *Fields to Import*. - Auto-Detect: Tries to auto detect fields in the CSV *File to Import*. - Ok: Proceeds the data import. - Cancel
de_de: - Hinzufügen: Fügt die ausgewählten Felder zu *Zu importierende Felder* hinzu - Entfernen: Löscht die ausgewählten Felder von *Zu importierende Felder* - Leeren: Löscht alle Felder aus *Zu importierende Felder* - OK: Importiert die Daten - Abbrechen: Bricht den Vorgang ab.

source: Options ^^^^^^^ The Options menu sets up several visual and context depending preferences.
de_de: Einstellungen ^^^^^^^^^^^^^ Das Einstellungs-Menü konfiguriert viele grafische und kontextabhängige Eigenschaften.

source: Toolbar +++++++
de_de: Werkzeugleiste ++++++++++++++

source: Default: Shows labels and icons as defaulted in the GTK configuration.
de_de: Standard: Zeigt Bezeichnung und Symbole wie in der systemweiten GTK-Konfiguration eingestellt.

source: Text and Icons: Shows labels and icons in the tool bar.
de_de: Text und Symbole: Zeigt Bezeichnungen und Symbole in der Werkzeugleiste an.

source: Icons: Shows icons only in the tool bar.
de_de: Symbole: Zeigt nur Symbole in der Werkzeugleiste an.

source: Text: Shows labels only in the tool bar.
de_de: Text: Zeigt nur Bezeichnungen in der Werkzeugleiste an.

source: Menubar +++++++
de_de: Menüleiste ++++++++++

source: Change Accelerators: If checked, keyboard shortcuts can be defined. S. a. `mouse and keyboard use`_
de_de: Kurzbefehle ändern: Falls das Kontrollkästchen aktiv ist, können Tastaturkürzel eingestellt werden. Siehe auch `Maus- und Tastaturbedienung`_

source: Mode ++++
de_de: Modus +++++
