Repository: mediafactory/tryton_client_desktop
Catalog: doc/*/usage.po
Languages: de_de

source: Client Usage ############ This document is the reference about the concepts of the graphical user interface (also known as *Tryton client* ) of the Tryton application framework.
de_de: Client Bedienung ################ Dieses Dokument stellt die Konzepte der grafischen Benutzer Oberfläche (*Tryton Client*) für die Tryton Anwendungs-Plattform dar.

source: Name **** tryton - Graphical user client of the Tryton application framework
de_de: Name **** tryton - grafischer Benutzeroberfläche der Tryton Anwendungs-Plattform

source: Synopsis ********
de_de: Kurzfassung ***********

source: tryton [options]
de_de: tryton [Optionen]

source: After startup, there raises the `login dialog`__ and optionally a `tips dialog`__.
de_de: Nach dem Start öffnet sich der `Anmeldedialog`__ und optional ein `Tippdialog`__.

source: Options *******
de_de: Optionen ********

source: --version Show program version number and exit
de_de: --version Zeigt die Programm-Version und beendet sich

source: -h, --help Show help message and exit
de_de: -h, --help Zeigt die Hilfe an und beendet sich

source: -c FILE, --config=FILE Specify alternate `configuration file`_
de_de: -c FILE, --config=FILE Angabe einer alternativen `Konfigurations-Datei`__

source: -v, --verbose Enable basic debugging
de_de: -v, --verbose Einschalten einer einfachen Fehleranzeige

source: -d LOG_LOGGER, --log=LOG_LOGGER Specify channels to log (ex: rpc.request, rpc.result, ...)
de_de: -d LOG_LOGGER, --log=LOG_LOGGER Angabe des zu protokollierenden Kanals (z. B.: rpc.request, rpc.result, ...)

source: -l LOG_LEVEL, --log-level=LOG_LEVEL Specify the log level: INFO, DEBUG, WARNING, ERROR, CRITICAL
de_de: -l LOG_LEVEL, --log-level=LOG_LEVEL Angebe der Protokollebene: INFO, DEBUG, WARNING, ERROR, CRITICAL

source: -u LOGIN, --user=LOGIN Specify the login user
de_de: -u LOGIN, --user=LOGIN Angabe des Anmelde-Benutzer

source: -p PORT, --port=PORT Specify the server port
de_de: -p PORT, --port=PORT Angabe des Server-Ports

source: -s SERVER, --server=SERVER Specify the server hostname
de_de: -s SERVER, --server=SERVER Angabe des Server-Hostnamens __ Konfigurations-Dateien_

source: Overview ******** The following schematic illustration of the Tryton client shows the names of all important visual parts.
de_de: Übersicht ********* Die folgende schematische Darstellung des Tryton Clients zeigt die Namen aller wichtigen Elemente der Benutzeroberfläche.

source: Figure: Tryton client application::
de_de: Abbildung: Tryton Client Anwendung::

source: Client Window _______________________________________________________ | Tryton _ o x| |-------------------------------------------------------| Menu bar | File User Form Options Plugins Shortcuts Help | |_______________________________________________________| | | Tool bar | New Save | Delete | Find Previous Next Switch v | |-------------------------------------------------------| | ______ | Tab bar | [Menu] |[Tab1]| [Tab2] ... | |---------| | -------------------------------------| | .------- ------------------------------------. | | | | | | | | | | | | | | | | | | | | | View | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | |___________________________________________________| | |_______________________________________________________| Status bar |username company Waiting requests... login@...| |_______________________________________________________|
de_de: Client Fenster _______________________________________________________ | Tryton _ o x| |-------------------------------------------------------| Menüleiste | Datei Benutzer Formular Einstellungen ... Hilfe | |_______________________________________________________| | | Werkzeugleiste | Neu Speichern | Löschen | Suchen Vor Zurück v | |-------------------------------------------------------| | ______ | Tableiste | [Menü] |[Tab1]| [Tab2] ... | |---------| | -------------------------------------| | .------- ------------------------------------. | | | | | | | | | | | | | | | | | | | | | Sicht | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | |___________________________________________________| | |_______________________________________________________| Statusleiste | Benutzername Firma Wartende Anfragen... login@... | |_______________________________________________________|

source: Menu Bar ^^^^^^^^ The menu bar is the main control unit. It provides most of the functionalities of the client application. The menu bar is grouped into categories. It is controlled with mouse or keyboard. The `menu bar items`_ are explained later.
de_de: Menüleiste ^^^^^^^^^^^ Die Menüleiste ist das Hauptkontrollfeld. Es stellt den Großteil an Funktionalität der Client Anwendung zur Verfügung. Die Menü-Leiste ist in Kategorien unterteilt und kann mit Maus und Tastatur bedient werden. Die `Menüleisten-Elemente`_ werden später erklärt.

source: Mouse and Keyboard Use ++++++++++++++++++++++ Most functions of the Tryton client can be accessed with mouse or keyboard. `Key bindings`__ for all menu items are preset. Furthermore all key bindings are manually configurable. To change the binding of a menu item the user needs to put the cursor onto it and simply press the user defined key combination. For this purpose it is needed to activate the configuration of the key bindings with Options > Menubar > Change Accelerators. After the configuration it is preferable to disable Change Accelerators, to avoid accidental changes of key bindings while navigating the Menu bar with the keyboard.
de_de: Maus- und Tastaturbedienung +++++++++++++++++++++++++++ Die meisten Funktionen des Tryton Client können mit Maus oder Tastatur benutzt werden. Für alle Menüpunkte sind `Tastaturkürzel`__ verfügbar. Zusätzlich sind alle Tastaturkürzel manuell konfigurierbar. Um das Kürzel eines Menüpunkts zu ändern muss man den Mauszeiger über dem Menüpunkt positionieren und das neue benutzerdefinierte Tastaturkürzel drücken. Um diese Möglichkeit nutzen zu können muss man unter Einstellungen > Menüleiste > Kurzbefehle ändern aktivieren. Nach dem Ändern der Tastaturkürzel sollte man nicht vergessen diese Funktion wieder auszuschalten um eine versehentliche Änderung von Tastaturkürzeln zu vermeiden während man in den Menüpunkten navigiert.

source: .. Note:: Usually key bindings are composed with modifier keys.
de_de: .. Note:: Üblicherweise werden Tastaturkürzel mit den Modifikationstasten kombiniert.

source: Additionally the menu bar items are accessible with the *Alt* or *Option* key. The user needs to hold the *Alt* or *Option* key followed by the underlined character of the menu bar item to choose. To dive into deeper menu levels, he needs to release the *Alt* or *Option* key and to simply press the underlined letter of the sub menu item. If there exist several menu items with the same shortcut, repeated activation of the shortcut key will jump to the next one.
de_de: Zusätzlich sind die Menüpunkte erreichbar mit den *Alt*- und *Options*-Tasten. Der Benutzer muss die *Alt*- und *Options*-Taste kombiniert mit dem unterstrichenen Buchstaben des Menüpunkts drücken. Um in weitere Untermenüs zu navigieren, die *Alt*- oder *Options*-Taste loslassen und den unterstrichenen Buchstaben des gewünschten Untermenüs drücken. Falls mehrere Menüpunkte mit dem gleichen Tastaturkürzel existieren, dieses Tastaturkürzel nochmals ausführen um zum nächsten Menüpunkt zu springen.

source: The second mouse button (usually right mouse button) provides an additional contextual menu for some views and fields. In this context menu the user finds :term:`actions` to copy and paste contents or setting up default values or selections for several fields.
de_de: Die zweite Maustaste (normalerweise die rechte Maustaste) stellt ein zusätzliches Kontextmenü für weitere Sichten und Felder zur Verfügung. In diesem Kontextmenü findet der Benutzer :term:`Aktionen` um Inhalte zu kopieren oder einzufügen, Vorgabewerte zu setzen oder um Auswahlen für verschiedene Felder zu erhalten.

source: Tool Bar ^^^^^^^^ The tool bar contains some often used menu functions mapped to icons. In addition to the menu bar the tool bar contains a button called *Attachment*. The attachment item handles the document management system of Tryton which is able to attach files to any arbitrary :term:`model`. The button is showing how many attachments are linked to the current view. On click it opens the attachment :term:`dialog`. This dialog has the following layout:
de_de: Werkzeugleiste ^^^^^^^^^^^^^^ Die Werkzeugleiste enthält Symbole für oft benutzte Menüfunktionen. Zusätzlich zur Menüleiste beinhaltet die Werkzeugleiste den Knopf *Dateianhang*. Das Dateianhang-Element stellt das Dokumenten Management System von Tryton bereit. Es ist in der Lage Dateien an jedes beliebige :term:`Modell` anzuhängen. Der Knopf zeigt wie viele Anhänge mit der aktuellen Sicht verknüpft sind. Beim Mausklick öffnet sich der :term:`Dialog` Anhang. Dieser Dialog hat folgendes Layout:

source: * Preview: Show a preview picture of the selected attachment * Description: Show and edit free text description for the selected attachment * Attachment list: Show and select all attachments for the given resource * Actions:
de_de: * Vorschau: Zeigt eine Vorschaubild des ausgewählten Anhangs * Beschreibung: Anzeige und editieren einer freien Text-Beschreibung des ausgewählten Anhangs * Anhangs-Liste: Anzeige und Auswahl aller Anhänge zur ausgewählten Ressource * Aktionen:

source: - Save Text: Save the description text to the selected attachment. - Add File...: Add a file as attachment. A file dialog opens. - Add Link...: Add a link to a file as attachment. A file dialog opens. - Save as...: Save the selected attachment to the local file system. - Delete...: Delete the selected attachment. - Close
de_de: - Text speichern: Speichert den Text der Beschreibung zum ausgewählten Anhang - Datei hinzufügen...: Fügt eine Datei als Anhang hinzu. Es öffnet sich ein Dateiauswahl-Dialog - Verweis hinzufügen...: Fügt eine Verknüpfung zu einer Datei als Anhang hinzu. Es öffnet sich ein Dateiauswahl-Dialog - Speichern als...: Speichert den ausgewählte Anhang auf das lokale Dateisystem - Löschen...: Löscht den ausgewählten Anhang - Schließen: Schließt den Anhang-Dialog

source: Tabbed Main Frame ^^^^^^^^^^^^^^^^^ This part of the client contains all the related contents and functions provided by the :term:`Tryton server` :term:`modules`. All aspects inside the *main frame* depend at least on the individual set of installed modules.
de_de: Hauptfenster mit Tabs ^^^^^^^^^^^^^^^^^^^^^ Dieser Teil des Tryton Client beinhaltet alle Inhalte und Funktionen die durch die :term:`Tryton Server`-:term:`Module` bereitgestellt werden. Alles innerhalb des *Hauptfensters* hängt von den individuell installierten Modulen ab.

source: The main frame provides a `tabbed document interface`__ to arrange different views side by side. New :term:`tabs` are opened by special :term:`actions`, like choosing a menu item or clicking some action buttons. All tabs include titles which show the name of the provided view.
de_de: Das Hauptfenster stellt `Tabs`__ bereit um verschiedene Sichten nebeneinander anzuordnen. Neue :term:`Tabs` werden durch spezielle :term:`Aktionen` wie zum Beispiel das Auswählen eines Menüpunkts oder durch klicken von Aktionsknöpfen geöffnet. Alle Tabs haben einen Titel, der den Namen der verwendeten Sicht zeigt.

source: :term:`Tabs` can be arranged by Drag and Drop.
de_de: :term:`Tabs` können mit Drag and Drop verschoben werden.

source: .. _TDI: http://en.wikipedia.org/wiki/Tabbed_document_interface
de_de: .. _TDI: http://de.wikipedia.org/wiki/Registerkarte

source: .. Note:: Inside :term:`views` there can be tabs, too.
de_de: .. Note:: Innerhalb einer :term:`Sicht` kann es auch Tabs geben.

source: Main Menu +++++++++ The first left tab contains the *main menu* (... not to mix up with the menu bar!). The *main menu* does not contain fixed menu items. All of them are dynamically provided by the actual set of the installed :term:`modules` depending on the access rules of the current user. If a menu item is clicked, the appropriate action will open in a new tab. As the figure below illustrates, the *main menu* is split up in three frames.
de_de: Hauptmenü +++++++++ Das erste Tab beinhaltet das *Hauptmenü* (... nicht zu verwechseln mit der Menüleiste!). Das *Hauptmenü* beinhaltet keine festen Menüpunkte. Diese werden dynamisch von den installierten :term:`Modulen <Module>` und abhängig von den Zugriffsrechten des aktuellen Benutzers bereitgestellt. Sobald ein Menüpunkt gedrückt wird öffnet sich durch die hinterlegte Aktion eine neuer Tab. Wie das Schaubild zeigt ist das *Hauptmenü* in drei Bereiche unterteilt.

source: The upper left frame contains the first or top level entries of the *main menu*. Standard top level entries are 'Administration' and 'Tryton'.
de_de: Der obere linke Bereich beinhaltet die Obersten bzw. Haupt-Menüpunkte des *Hauptmenüs*. Standard Haupt-Menüpunkte sind 'Systemverwaltung' und 'Tryton'.

source: .. note:: The *administration* menu will be explained in the modules documentation for the 'IR' module, the *information repository*.
de_de: .. note:: Das *Systemverwaltung*-Menü wird in der Moduldokumentation des 'IR' Moduls ('information repository' - Informations-Ablage) dokumentiert.

source: The top level entry 'Tryton' connects to the website of the Tryton project.
de_de: Der Haupt-Menüpunkt 'Tryton' ruft die Webseite des Tryton Projekts auf.

source: The right frame is showing a :term:`tree view` substructure of menu *items* and *headings*. With the arrow keys it is possible to navigate inside the menu. By pressing *Enter* or double-clicking onto the menu item the appropriate :term:`views` open. Use left and right arrow to expand or contract sub items of a heading.
de_de: Der rechte Bereich zeigt eine :term:`Baumansicht` der Haupt- und Unter-Punkte des gewählten Moduls. Mit den Pfeiltasten kann man sich innerhalb diese Menüs bewegen. Durch drücken der "Enter"-Taste oder mit einem Doppelklick öffnet sich das dazugehörige Menü. Mit den Pfeiltasten Links und Rechts kann man die verschiedenen Ebenen der Baumansicht aus- und einklappen.

source: Figure: Main Menu Tab::
de_de: Schaubild: Hauptmenü Tab::

source: ________________________________________________________ | Tryton _ o x| |--------------------------------------------------------| | File User Form Options Plugins Shortcuts Help | |________________________________________________________| | | | New Save | Delete | Find Previous Next Switch v | |________________________________________________________| | ______ | | |[Menu]| [Tab1] [Tab2] ... | |--| | ---------------------------------------------| | | -------------.------------------------------. | | | Top Level Entry 1 | Menu | | | | | Top Level Entry 2 |---------------------+--------| | | | ... | Item 1 | | | | | Administration | Item 2 | | | | | Tryton | > Heading | | | | |____________________| Sub Item 1 | | | | | Shortcuts [+][-]| Sub Item 2 | | | | |--------------------| > Sub Heading | | | | | Sub Item 2 | Sub Sub ... | | | | | | | | | | | | | | | | |____________________|_____________________|________| | |________________________________________________________| |username company Waiting requests... login@... | |________________________________________________________|
de_de: ________________________________________________________ | Tryton _ o x| |--------------------------------------------------------| | Datei Benutzer Formular Einstellungen ... Hilfe | |________________________________________________________| | | | Neu Speichern | Löschen | Suchen Vor Zurück v | |________________________________________________________| | ______ | | |[Menü]| [Tab1] [Tab2] ... | |--| | ---------------------------------------------| | | -------------.------------------------------. | | | Hauptmenü-Punkt 1 | Menü | | | | | Hauptmenü-Punkt 2 |---------------------+--------| | | | ... | Item 1 | | | | | Administration | Item 2 | | | | | Tryton | > Überschrift | | | | |____________________| Unterpunkt 1 | | | | | Favoriten [+][-]| Unterpunkt 2 | | | | |--------------------| > Unterüberschrift | | | | Unterpunkt 2 | weitere | | | | | | Unterpunkte| | | | | | ... | | | | |____________________|_____________________|________| | |________________________________________________________| | Benutzername Firma Wartende Anfragen... login@... | |________________________________________________________|

source: The lower left menu frame shows a user adjustable *shortcuts* menu. This menu is for collecting often used menu items. Using a *shortcut* item will open the appropriate view in a new tab, just with a double mouse click. A menu item is added to the *shortcut* menu by pushing the plus button [+] in the *shortcut* menu. The minus button [-] removes a selected *shortcut* item from the list.
de_de: Der linke untere Bereich zeigt ein *Favoriten* Menü, welches durch den Benutzer selbst angepasst werden kann. Durch einen Doppelklick auf den entsprechenden Eintrag wird die dazu passende Sicht aufgerufen. Die aktuelle Sicht wird als Favorit durch Klick des Plus-Knopfes [+] dem Menü hinzugefügt. Der Minus-Knopf [-] löscht den ausgewählten Favoriten aus dieser Liste.

source: Home Action +++++++++++ Another tab opens during the startup of the Tryton client: the home action. It is usually an item of the `Main Menu`_ opening when the user calls his `Home`__ action defined in the `preferences`__.
de_de: Startseite ++++++++++ Eine weiterer Tab öffnet sich während des Startens des Tryton Client: Die Startseite. Für gewöhnlich ist es ein Punkt des `Hauptmenü`__, der geöffnet wird sobald der Benutzer die *Startseite* ausführt. Diese Standardaktion wird in den `Einstellungen`__ definiert.

source: Status bar ++++++++++ The status bar provides general informations of the state of the Tryton client. It is divided in three parts.
de_de: Statusleiste +++++++++++++ Die *Statusleiste* stellt generelle Informationen über den Status des Tryton Client bereit. Sie ist in drei Abschnitte unterteilt.

source: * On its left side the real name and company name of the users actual company is shown. * In the center of the status bar the number of waiting requests for the actual user are displayed. * On its right side are details of the server connection shown including database and user informations if connected. It is also noted there, if there is no connection to a Tryton server at all. The right side information of the status bar is build with the following pattern::
de_de: * Auf der linken Seite befindet sich der Name und der Firmenname des aktuellen Benutzers. * In der Mitte der Statusleiste wird die Anzahl der offene Anfragen des aktuellen Benutzers bereitgestellt. * Auf der rechten Seite werden Details zur Server Verbindung gezeigt mit Informationen zum Benutzer und zur Datenbank sobald man verbunden ist. Hier wird auch angezeigt falls es keine Verbindung zu einem Tryton Server besteht. Dieser Bereich wird nach folgendem Muster erzeugt::

source: <user-name>@<tryton-server-address>:<port>/<database-name>
de_de: <Benutzer-Name>@<Tryton-Server-Adresse>:<Port>/<Datenbank-Name>

source: If the client is connected to the server with an SSL-secured connection, an additional lock icon appears rightmost some certificate details in a mouse hover popup.
de_de: Sobald der Client mit einer SSL-verschlüsselten Verbindung zum Server verbunden hat erscheint ein zusätzliches Vorhängeschloss-Symbol mit weiteren Zertifikats- Details sobald sich der Mauszeiger auf diesem Symbol befindet.

source: The Status bar can be enabled and disabled in the menu at Options > Form > Status bar
de_de: Die Statusleiste kann aus- und eingeschalten werden über die Menüleiste Einstellungen > Formular > Statusleiste

source: Menu Bar Items ************** The following section describes the function of each menu bar entry in detail. A rule of thumb: All items of the menu bar that are suffixed by three dots (...) will open an intermediate :term:`dialog` for setting up the provided menu action. Most dialogs provide a *Cancel* button, used to stop the complete dialog process.
de_de: Menüleisten-Elemente ******************** Das folgende Kapitel beschreibt die Funktionen jedes Menüleisten-Eintrags im Detail. Als Faustregel gilt: Jeder Menüpunkt, welcher mit drei Punkten endet [...] öffnet direkt den :term:`Dialog` der zugewiesenen Menüaktion. Die meisten Dialoge stellen einen *Abbrechen* Knopf bereit um den kompletten Vorgang abzubrechen.

source: File ^^^^ The file menu level provides functions about Tryton server login, Database maintenance and closing the client application.
de_de: Datei ^^^^^ Das *Datei* Menü stellt Funktionen des Tryton Servers wie Anmelden, Datenbankpflege und zum schließen der Client Anwendung.

source: Connect... By choosing this menu entry the client will be connected to an available Tryton server. A :term:`dialog` opens to request credentials:
de_de: Verbinden... Bei Auswahl dieses Menüeintrags verbindet sich der Client zu einem verfügbaren Tryton Server. Ein :term:`Dialog` öffnet sich zur Eingabe des Benutzernamens und Passwortes.

source: * `Server`__ * Database: Database to connect server side * User name: Tryton user name to login * Password: Tryton password to login * Actions:
de_de: * `Serververbindung`__ * Datenbank: Datenbank auf Serverseite zu der die Verbindung aufgebaut werden soll * Benutzername: Tryton Benutzername um sich anzumelden * Passwort: Tryton Passwort um sich anzumelden * Aktionen:

source: - Connect: Connects to the server with the given credentials. - Cancel
de_de: - Verbinden: Verbindet zum Server mit den bereitgestellten Daten - Abbrechen: Bricht den Dialog ab

source: .. note:: Depending on server configuration for session timeout, the actual user may be logged out of the current session, and need to login again. Default timeout for inactivity logout is six minutes.
de_de: .. note:: Abhängig von den Servereinstellungen wird der Benutzer nach einer gewissen Zeitspanne von der aktuellen Verbindung abgemeldet und muss sich wieder anmelden. Die voreingestellte Zeitspanne des automatischen Abmeldens beträgt 6 Minuten.

source: Disconnect... Disconnects the client from an active server connection. In case of unsaved changes in an open tab, the Tryton client will request for saving the changes.
de_de: Verbindung trennen... Trennt den Client von einer aktiven Server Verbindung. Falls nicht gespeicherte Änderungen in einem offenen Tab existieren, fordert der Tryton Client zum Speichern der Änderungen auf.

source: Database ++++++++ This menu level provides tools to maintain Tryton databases. For all database operations the user needs to know the Tryton server password.
de_de: Datenbank +++++++++ Dieses Untermenü stellt Werkzeuge zur Wartung der Tryton Datenbank bereit. Für alle Datenbankoperationen benötigt der Benutzer das Tryton Server Passwort.

source: .. warning:: Consider not to use this server-site maintaining functions, if there are security concerns. Since there are always security concerns in a multiuser environment, better disclaim to provide these functions on database level.
de_de: .. warning:: Falls Sicherheitsbedenken bestehen sollten Sie diese serverbasierten Werkzeuge nicht nutzen. Da es in einer Mehrbenutzer-Umgebung immer Sicherheitsbedenken gibt, ist es besser diese Funktionen auf Datenbank-Ebene zu verbieten.

source: .. note:: Database names are restricted by some rules:
de_de: .. note:: Datenbank-Namen sind durch folgende Regeln eingeschränkt:
